# Задайте список из N элементов, заполненных числами из промежутка [-N, N]. 

n = int(input('Введите число N:  '))
lst = list(range(-n, n+1))
print(lst)